<?php

namespace App\Console\Commands;

use App\Imports\WorkmanImport;
use Illuminate\Console\Command;
use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use App\Gongyang;
use App\Workman;


class importchange extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'import:change';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'change unit name';



    public $gongyang = ["人大常委会"=>"人大办","政协"=>"政协办","委办"=>"县委办","委信访局"=>"信访局","委组织部"=>"组织部","中共遂川县宣传部"=>"宣传部","统战部"=>"统战部","茶产业发展中心"=>"茶产业发展中心","中共遂川县委政法委员会"=>"政法委","纪律检查委员会"=>"纪委监委","机构编制委员会办公室"=>"编办","中共遂川县委党校"=>"党校","委党史和地方志研究中心"=>"史志中心","委老干部局"=>"老干局","发展改革委员会"=>"发改委","工业和信息化管理局"=>"工信局","工业智能化推进中心"=>"工业推进中心","科技局"=>"科技局","退役军人事务局"=>"退役军人局","公安局"=>"公安局","民政局"=>"民政局","民政事务综合服务中心"=>"民政事务中心","司法局"=>"司法局","人力资源和社会保障局"=>"人社局","社保中心"=>"社保中心","县就业创业服务中心"=>"就创中心","财政局"=>"财政局","会计核算中心"=>"会计核算中心","审计局"=>"审计局","自然资源局"=>"自然资源局","县农业农村局"=>"农业农村局","林业局"=>"林业局","森林公安局"=>"森林公安局","五指峰林场"=>"五指峰林场","云岭林场"=>"云岭林场","龙泉林场"=>"龙泉林场","乡村振兴局"=>"乡村振兴局","水利局"=>"水利局","水利工程建设管护中心"=>"水利工程管护中心","住房和城乡建设局"=>"住建局","城镇发展服务中心"=>"城镇发展服务中心","城市管理局"=>"城管局","城镇农贸市场服务中心"=>"城镇农贸市场服务中心","环卫所"=>"环卫所","住房保障服务中心"=>"住房保障服务中心","应急管理局"=>"应急管理局","交通运输局"=>"交通运输局","交通运输发展中心"=>"交通运输发展中心","县交通运输综合行政执法大队"=>"交通执法大队","狗牯脑茶文化传承中心"=>"茶文化传承中心","图书馆"=>"图书馆","文化馆"=>"文化馆","文广新旅局"=>"文广新旅局","融媒体中心"=>"融媒体中心","教育体育局"=>"教育体育局","遂川中学"=>"遂川中学","遂川二中"=>"遂川二中","教育体育发展中心"=>"教体发展中心","机关保育院"=>"机关保育院","泉江中学"=>"泉江中学","瑶厦中学"=>"瑶厦中学","泉江小学"=>"泉江小学","水南明德小学"=>"水南明德小学","荧屏小学"=>"荧屏小学","正人中学"=>"正人中学","上海警备区希望小学"=>"上海警备希望小学","上坑中心学校"=>"上坑中心学校","于田中学"=>"雩田中学","于田三中"=>"雩田三中","于田中心小学"=>"雩田小学","横岭志强希望学校"=>"横岭志强希望学校","大坑中学"=>"大坑中学","大坑中心小学"=>"大坑小学","珠田中学"=>"珠田中学","珠田中心小学"=>"珠田小学","禾源中学"=>"禾源中学","禾源中心小学"=>"禾源小学","枚江中学"=>"枚江中学","枚江中心小学"=>"枚江小学","碧洲中学"=>"碧洲中学","碧洲中心小学"=>"碧洲小学","巾石中学"=>"巾石中学","巾石中心小学"=>"巾石小学","草林中学"=>"草林中学","草林中心小学"=>"草林小学","南江中学"=>"南江中学","南江中心小学"=>"南江小学","左安中学"=>"左安中学","左安中心小学"=>"左安小学","扬芬小学"=>"扬芬小学","汤湖中学"=>"汤湖中学","汤湖中心小学"=>"汤湖阳光希望小学","高坪中学"=>"高坪中学","遂川北京西站小学"=>"高坪北京西站小学","堆前中学"=>"堆子前中学","堆前中心小学"=>"堆子前平安希望小学","西溪中学"=>"西溪中学","西溪中心小学"=>"西溪小学","大汾中学"=>"大汾中学","大汾中心完小"=>"大汾小学","滁洲中心学校"=>"滁洲中心学校","戴家埔中学"=>"戴家埔中学","戴家埔中心小学"=>"戴家埔小学","淋洋中心学校"=>"淋洋中心学校","深圳格瑞特希望学校"=>"深圳格瑞特希望学校","五斗江中学"=>"五斗江中学","五斗江中心小学"=>"五斗江小学","新江中学"=>"新江中学","新江中心小学"=>"新江小学","衙前中学"=>"衙前中学","衙前中心小学"=>"衙前小学","双桥中心学校"=>"双桥中心学校","黄坑中学"=>"黄坑中学","黄坑中心小学"=>"黄坑小学","红军小学"=>"红军小学","龙泉幼儿园"=>"龙泉幼儿园","江铃希望学校"=>"江铃希望学校","水南幼儿园"=>"水南幼儿园","泉江幼儿园"=>"泉江幼儿园","思源实验学校"=>"思源学校","燕山中学"=>"燕山中学","八角楼学校"=>"八角楼学校","大汾幼儿园"=>"大汾幼儿园","南江幼儿园"=>"南江幼儿园","草林幼儿园"=>"草林幼儿园","衙前幼儿园"=>"衙前幼儿园","左安幼儿园"=>"左安幼儿园","汤湖幼儿园"=>"汤湖幼儿园","工业园东区幼儿园"=>"工业园东区幼儿园","遂兴幼儿园"=>"遂兴幼儿园","思源幼儿园"=>"思源幼儿园","荧屏幼儿园"=>"荧屏幼儿园","第一工业园区幼儿园"=>"第一工业园区幼儿园","扬汾中学"=>"扬芬中学","思源小学"=>"思源小学","特殊教育学校"=>"特殊教育学校","卫健委"=>"卫健委","人民医院"=>"人民医院","中医院"=>"中医院","妇幼保健计划生育服务中心"=>"妇幼保健中心","疾病预防控制中心"=>"疾控中心","康复医院"=>"康复医院","于田卫生院"=>"雩田卫生院","衙前中心卫生院"=>"衙前卫生院","堆前中心卫生院"=>"堆前卫生院","大汾中心卫生院"=>"大汾卫生院","左安中心卫生院"=>"左安卫生院","草林中心卫生院"=>"草林卫生院","巾石中心卫生院"=>"巾石卫生院","双桥卫生院"=>"双桥卫生院","新江卫生院"=>"新江卫生院","五江乡卫生院"=>"五江乡卫生院","西溪卫生院"=>"西溪卫生院","代家埔卫生院"=>"戴家埔卫生院","营盘圩卫生院"=>"营盘圩卫生院","高坪卫生院"=>"高坪卫生院","汤湖卫生院"=>"汤湖卫生院","黄坑卫生院"=>"黄坑卫生院","南江卫生院"=>"南江卫生院","禾源卫生院"=>"禾源卫生院","碧州卫生院"=>"碧洲卫生院","枚江卫生院"=>"枚江卫生院","大坑卫生院"=>"大坑卫生院","珠田卫生院"=>"珠田卫生院","泉江镇盆珠卫生"=>"盆珠卫生","上坑卫生院"=>"上坑卫生院","卫计委综合监督局"=>"卫监局","滁州卫生院"=>"滁洲卫生院","淋洋卫生院"=>"淋洋卫生院","横岭卫生院"=>"横岭卫生院","扬芬卫生院"=>"扬芬卫生院","统计局"=>"统计局","市场监督管理局机关"=>"市监局","人民政府办公室"=>"政府办","商务局"=>"商务局","遂川工业园区管委会"=>"工业园区管委会","行政服务中心"=>"行政服务中心","合作交流中心"=>"合作交流中心","机关事务中心"=>"机关事务管理中心","城市社区管理委员会"=>"城市社区管委会","县公安交警大队"=>"交警大队","文物办"=>"文物办","医疗保障局"=>"医保局","医疗保障服务中心"=>"医保中心","县人武部"=>"人武后勤服务中心","县总工会"=>"总工会","共青团遂川县委"=>"团县委","妇女联合会"=>"妇联","县工商业联合会"=>"工商联","县文学艺术界联合会"=>"文联","县科学技术协会"=>"科协","红十字会"=>"红十字会","残疾人联合会"=>"残联","县供销合作社联合社"=>"供销社","泉江镇人民政府"=>"泉江镇人民政府","泉江镇敬老院一部"=>"泉江镇敬老院一部","泉江敬老院院二部"=>"泉江敬老院院二部","泉江敬老院院三部"=>"泉江敬老院院三部","雩田镇人民政府"=>"雩田镇人民政府","雩田镇敬老院"=>"雩田镇敬老院","碧洲镇人民政府"=>"碧洲镇人民政府","碧洲镇敬老院"=>"碧洲镇敬老院","草林镇人民政府"=>"草林镇人民政府","草林镇敬老院"=>"草林镇敬老院","堆子前镇人民政府"=>"堆子前镇人民政府","堆子前镇敬老院"=>"堆子前镇敬老院","左安镇人民政府"=>"左安镇人民政府","左安镇敬老院"=>"左安镇敬老院","高坪镇人民政府"=>"高坪镇人民政府","高坪镇敬老院"=>"高坪镇敬老院","大汾镇人民政府"=>"大汾镇人民政府","大汾镇敬老院"=>"大汾镇敬老院","衙前镇人民政府"=>"衙前镇人民政府","衙前镇敬老院"=>"衙前镇敬老院","禾源镇人民政府"=>"禾源镇人民政府","禾源镇敬老院"=>"禾源镇敬老院","汤湖镇人民政府"=>"汤湖镇人民政府","汤湖镇敬老院"=>"汤湖镇敬老院","珠田乡人民政府"=>"珠田镇人民政府","珠田乡敬老院"=>"珠田镇敬老院","巾石乡人民政府"=>"巾石乡人民政府","巾石乡敬老院"=>"巾石乡敬老院","大坑乡人民政府"=>"大坑乡人民政府","大坑乡敬老院"=>"大坑乡敬老院","枚江镇人民政府"=>"枚江镇人民政府","枚江镇敬老院"=>"枚江镇敬老院","双桥乡人民政府"=>"双桥乡人民政府","双桥乡敬老院"=>"双桥乡敬老院","新江乡人民政府"=>"新江乡人民政府","新江乡敬老院"=>"新江乡敬老院","五斗江乡人民政府"=>"五斗江乡人民政府","五斗江乡敬老院"=>"五斗江乡敬老院","西溪乡人民政府"=>"西溪乡人民政府","西溪乡敬老院"=>"西溪乡敬老院","南江乡人民政府"=>"南江乡人民政府","南江乡敬老院"=>"南江乡敬老院","黄坑乡人民政府"=>"黄坑乡人民政府","黄坑乡敬老院"=>"黄坑乡敬老院","戴家埔乡人民政府"=>"戴家埔乡人民政府","戴家埔乡敬老院"=>"戴家埔乡敬老院","营盘圩乡人民政府"=>"营盘圩乡人民政府","营盘圩乡敬老院"=>"营盘圩乡敬老院","粮食局"=>"粮食局"];




        public $workman = ["上坑中心学校"=>"上坑中心学校","上坑卫生院"=>"上坑卫生院","上海警备区希望小学"=>"上海警备希望小学","中共遂川县委信访局"=>"信访局","中共遂川县委党史和地方志研究中心"=>"史志中心","中共遂川县委党校"=>"党校","中共遂川县委办公室"=>"县委办","中共遂川县委政法委员会"=>"政法委","中共遂川县委机构编制委员会办公室"=>"编办","中医院"=>"中医院","乡村振兴局"=>"乡村振兴局","云岭林场"=>"云岭林场","五指峰林场"=>"五指峰林场","五斗江中心小学"=>"五斗江小学","五斗江乡人民政府"=>"五斗江乡人民政府","五斗江乡敬老院"=>"五斗江乡敬老院","五斗江卫生院"=>"五斗江卫生院","交通运输局"=>"交通运输局","交通运输综合行政执法大队"=>"交通执法大队","人力资源和社会保障局"=>"人社局","人大常委会办公室"=>"人大办","人武后勤保障中心"=>"人武后勤服务中心","人民医院"=>"人民医院","人民政府办公室"=>"政府办","会计核算中心"=>"会计核算中心","住房保障服务中心"=>"住房保障服务中心","住房和城乡建设局"=>"住建局","供销合作社联合社"=>"供销社","八角楼学校"=>"八角楼学校","公安局"=>"公安局","公安局交通警察大队"=>"交警大队","公安局森林分局"=>"森林公安局","农业农村局"=>"农业农村局","医疗保障局"=>"医保局","医疗保障服务中心"=>"医保中心","南江中学"=>"南江中学","南江乡中心幼儿园"=>"南江幼儿园","南江乡人民政府"=>"南江乡人民政府","南江乡敬老院"=>"南江乡敬老院","南江卫生院"=>"南江卫生院","卫健委"=>"卫健委","卫生健康综合监督执法局"=>"卫监局","双桥中心学校"=>"双桥中心学校","双桥乡人民政府"=>"双桥乡人民政府","双桥乡敬老院"=>"双桥乡敬老院","双桥卫生院"=>"双桥卫生院","发展和改革委员会"=>"发改委","司法局"=>"司法局","商务局"=>"商务局","城市社区管理委员会"=>"城市社区管委会","城市管理局"=>"城管局","城镇农贸市场服务中心"=>"城镇农贸市场服务中心","城镇发展服务中心"=>"城镇发展服务中心","堆前中学"=>"堆子前中学","堆子前中心卫生院"=>"堆子前卫生院","堆子前人民政府"=>"堆子前镇人民政府","堆子前平安希望小学"=>"堆子前平安希望小学","堆子前镇敬老院"=>"堆子前镇敬老院","大坑中学"=>"大坑中学","大坑中心小学"=>"大坑小学","大坑乡敬老院"=>"大坑乡敬老院","大坑人民政府"=>"大坑乡人民政府","大坑卫生院"=>"大坑卫生院","大汾中学"=>"大汾中学","大汾中心卫生院"=>"大汾卫生院","大汾中心小学"=>"大汾小学","大汾镇中心幼儿园"=>"大汾幼儿园","大汾镇人民政府"=>"大汾镇人民政府","大汾镇敬老院"=>"大汾镇敬老院","妇幼保健计划生育服务中心"=>"妇幼保健中心","妇联"=>"妇联","委县政府合作交流中心"=>"合作交流中心","委组织部"=>"组织部","委老干部局"=>"老干局","审计局"=>"审计局","就业创业服务中心"=>"就创中心","工业园东区幼儿园"=>"工业园东区幼儿园","工业智能化推进中心"=>"工业推进中心","工信局"=>"工信局","工商业联合会"=>"工商联","左安中学"=>"左安中学","左安中心卫生院"=>"左安卫生院","左安中心小学"=>"左安小学","左安镇中心幼儿园"=>"左安幼儿园","左安镇人民政府"=>"左安镇人民政府","左安镇敬老院"=>"左安镇敬老院","巾石中学"=>"巾石中学","巾石中心卫生院"=>"巾石卫生院","巾石中心小学"=>"巾石小学","巾石乡人民政府"=>"巾石乡人民政府","巾石乡敬老院"=>"巾石乡敬老院","市场监督管理局"=>"市监局","应急管理局"=>"应急管理局","康复医院"=>"康复医院","思源实验学校"=>"思源学校","思源实验小学"=>"思源小学","思源幼儿园"=>"思源幼儿园","总工会"=>"总工会","戴家埔中学"=>"戴家埔中学","戴家埔中心小学"=>"戴家埔小学","戴家埔乡人民政府"=>"戴家埔乡人民政府","戴家埔乡敬老院"=>"戴家埔乡敬老院","戴家埔卫生院"=>"戴家埔卫生院","扬芬中学"=>"扬芬中学","扬芬卫生院"=>"扬芬卫生院","政协办公室"=>"政协办","教育体育发展中心"=>"教体发展中心","教育体育局"=>"教育体育局","文化馆"=>"文化馆","文学艺术界联合会"=>"文联","文广新旅局"=>"文广新旅局","文物办"=>"文物办","新江中学"=>"新江中学","新江中心小学"=>"新江小学","新江乡人民政府"=>"新江乡人民政府","新江乡敬老院"=>"新江乡敬老院","新江卫生院"=>"新江卫生院","机关事务中心"=>"机关事务管理中心","机关保育院"=>"机关保育院","林业局"=>"林业局","枚江中学"=>"枚江中学","枚江中心小学"=>"枚江小学","枚江卫生院"=>"枚江卫生院","枚江镇人民政府"=>"枚江镇人民政府","枚江镇敬老院"=>"枚江镇敬老院","横岭卫生院"=>"横岭卫生院","横岭志强希望学校"=>"横岭志强希望学校","正人中学"=>"正人中学","正人红军小学"=>"红军小学","残疾人联合会"=>"残联","民政事务综合服务中心"=>"民政事务中心","民政局"=>"民政局","水利局"=>"水利局","水利工程建设管护中心"=>"水利工程管护中心","水南幼儿园"=>"水南幼儿园","水南明德小学"=>"水南明德小学","江西省遂川县图书馆"=>"图书馆","江西省遂川县职业中学"=>"职业中学","江铃希望学校"=>"江铃希望学校","汤湖中学"=>"汤湖中学","汤湖卫生院"=>"汤湖卫生院","汤湖镇中心幼儿园"=>"汤湖幼儿园","汤湖镇人民政府"=>"汤湖镇人民政府","汤湖镇敬老院"=>"汤湖镇敬老院","汤湖阳光希望小学"=>"汤湖阳光希望小学","泉江小学"=>"泉江小学","泉江幼儿园"=>"泉江幼儿园","泉江镇人民政府"=>"泉江镇人民政府","泉江镇敬老院一部"=>"泉江镇敬老院一部","泉江镇敬老院三部"=>"泉江敬老院院二部","泉江镇敬老院二部"=>"泉江敬老院院三部","淋洋中心学校"=>"淋洋中心学校","淋洋卫生院"=>"淋洋卫生院","深圳格瑞特希望学校"=>"深圳格瑞特希望学校","滁洲中心学校"=>"滁洲中心学校","滁洲卫生院"=>"滁洲卫生院","燕山中学"=>"燕山中学","狗牯脑茶文化传承中心"=>"茶文化传承中心","环境卫生管理所"=>"环卫所","珠田中学"=>"珠田中学","珠田中心小学"=>"珠田小学","珠田卫生院"=>"珠田卫生院","珠田镇人民政府"=>"珠田镇人民政府","珠田镇敬老院(珠田镇光荣院)"=>"珠田镇敬老院","瑶厦中学"=>"瑶厦中学","疾病预防控制中心"=>"疾控中心","盆珠卫生院"=>"盆珠卫生","碧洲中学"=>"碧洲中学","碧洲中心小学"=>"碧洲小学","碧洲卫生院"=>"碧洲卫生院","碧洲镇人民政府"=>"碧洲镇人民政府","碧洲镇敬老院"=>"碧洲镇敬老院","社会保险中心"=>"社保中心","禾源中学"=>"禾源中学","禾源中心小学"=>"禾源小学","禾源卫生院"=>"禾源卫生院","禾源镇人民政府"=>"禾源镇人民政府","禾源镇敬老院"=>"禾源镇敬老院","科学技术协会"=>"科协","科学技术局"=>"科技局","第一工业园区幼儿园"=>"第一工业园区幼儿园","粮食局"=>"粮食局","红十字会"=>"红十字会","纪委监委"=>"纪委监委","统计局"=>"统计局","综合交通运输事业发展中心"=>"交通运输发展中心","自然资源局"=>"自然资源局","茶产业发展中心"=>"茶产业发展中心","草林中学"=>"草林中学","草林中心卫生院"=>"草林卫生院","草林中心小学"=>"草林小学","草林镇中心幼儿园"=>"草林幼儿园","草林镇人民政府"=>"草林镇人民政府","草林镇敬老院"=>"草林镇敬老院","荧屏小学"=>"荧屏小学","荧屏幼儿园"=>"荧屏幼儿园","营盘圩乡人民政府"=>"营盘圩乡人民政府","营盘圩乡敬老院"=>"营盘圩乡敬老院","营盘圩卫生院"=>"营盘圩卫生院","融媒体中心"=>"融媒体中心","行政服务中心"=>"行政服务中心","衙前中学"=>"衙前中学","衙前中心卫生院"=>"衙前卫生院","衙前中心小学"=>"衙前小学","衙前镇中心幼儿园"=>"衙前幼儿园","衙前镇人民政府"=>"衙前镇人民政府","衙前镇敬老院"=>"衙前镇敬老院","西溪中学"=>"西溪中学","西溪中心小学"=>"西溪小学","西溪乡人民政府"=>"西溪乡人民政府","西溪乡敬老院"=>"西溪乡敬老院","西溪卫生院"=>"西溪卫生院","财政局"=>"财政局","退役军人事务局"=>"退役军人局","遂兴幼儿园"=>"遂兴幼儿园","遂川中学"=>"遂川中学","遂川工业园区管理委员会"=>"工业园区管委会","雩田三中"=>"雩田三中","雩田中学"=>"雩田中学","雩田中心小学"=>"雩田小学","雩田镇中心卫生院"=>"雩田卫生院","雩田镇人民政府"=>"雩田镇人民政府","雩田镇敬老院"=>"雩田镇敬老院","高坪中学"=>"高坪中学","高坪北京西站小学"=>"高坪北京西站小学","高坪卫生院"=>"高坪卫生院","高坪镇人民政府"=>"高坪镇人民政府","高坪镇敬老院"=>"高坪镇敬老院","黄坑中学"=>"黄坑中学","黄坑中心小学"=>"黄坑小学","黄坑乡人民政府"=>"黄坑乡人民政府","黄坑乡敬老院"=>"黄坑乡敬老院","黄坑卫生院"=>"黄坑卫生院","龙泉幼儿园"=>"龙泉幼儿园","龙泉林场"=>"龙泉林场"];


    /**
     * Create a new command instance.
     *
     * @return void
     */
    public function __construct()
    {
        parent::__construct();
    }

    /**
     * Execute the console command.
     *
     * @return int
     */
    public function handle()
    {
        foreach ($this->gongyang as $key => $value) {
            Gongyang::where('unitname', $key)->update(['unitname' => $value]);  
        }

        foreach ($this->workman as $key => $value) {
            Workman::where('unitname', $key)->update(['unitname' => $value]);  
        }
        $this->output->success('change successful');
    }
}




